benchmarks/results/20260908T1905Z_safe-rx5-final/safe-wperm-nt-postreboot/logs/prefill_in2048_out64_c4_r1.log
INFO 09-08 19:02:45 [importing.py:45] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 09-08 19:02:45 [importing.py:69] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 09-08 19:02:45 [interface.py:247] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(trust_remote_code=False, seed=20326811, num_prompts=8, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:11435', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='Qwen3.8-27B-Quark-AWQ-MXFP4', input_len=2048, output_len=64, tokenizer='/nvme/lexar-2/ai/models/Qwen3.8-27B-Quark-AWQ-MXFP4-amd', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['config=safe-wperm-nt-postreboot', 'workload=prefill', 'input_tokens=2048', 'output_tokens=64', 'repetition=1', 'tp=2', 'spec=on', 'cpu_offload_gb=0', 'seed=20326811', 'temperature=0'], result_dir=None, result_filename='benchmarks/results/20260908T1905Z_safe-rx5-final/safe-wperm-nt-postreboot/raw/prefill_in2048_out64_c4_r1.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-e61840b7-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-08 19:02:46 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [64, 64]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     8         
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  5.70      
Total input tokens:                      16384     
Total generated tokens:                  512       
Request throughput (req/s):              1.40      
Output token throughput (tok/s):         89.77     
Peak output token throughput (tok/s):    63.00     
Peak concurrent requests:                6.00      
Total token throughput (tok/s):          2962.32   
---------------Time to First Token----------------
Mean TTFT (ms):                          942.18    
Median TTFT (ms):                        525.22    
P50 TTFT (ms):                           525.22    
P90 TTFT (ms):                           1837.47   
P95 TTFT (ms):                           1837.48   
P99 TTFT (ms):                           1837.49   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          26.17     
Median TPOT (ms):                        24.67     
P50 TPOT (ms):                           24.67     
P90 TPOT (ms):                           44.66     
P95 TPOT (ms):                           51.71     
P99 TPOT (ms):                           57.35     
---------------Inter-token Latency----------------
Mean ITL (ms):                           73.26     
Median ITL (ms):                         33.59     
P50 ITL (ms):                            33.59     
P90 ITL (ms):                            38.44     
P95 ITL (ms):                            493.42    
P99 ITL (ms):                            509.49    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2590.60   
Median E2EL (ms):                        2034.21   
P50 E2EL (ms):                           2034.21   
P90 E2EL (ms):                           4497.82   
P95 E2EL (ms):                           4763.52   
P99 E2EL (ms):                           4976.07   
---------------Speculative Decoding---------------
Acceptance rate (%):                     27.14     
Acceptance length:                       2.90      
Drafts:                                  180       
Draft tokens:                            1260      
Accepted tokens:                         342       
Per-position acceptance (%):
  Position 0:                            65.00     
  Position 1:                            35.56     
  Position 2:                            24.44     
  Position 3:                            17.22     
  Position 4:                            16.67     
  Position 5:                            15.56     
  Position 6:                            15.56     
==================================================